rem 가게 정보DB
CREATE TABLE STOREDB
	(STORENUM VARCHAR2(10) CONSTRAINT PK_STOREDB PRIMARY KEY,
	 STORENAME VARCHAR2(50 CHAR) NOT NULL,
	 CATEGORY VARCHAR2(20 CHAR) NOT NULL,
	 LATITUDE VARCHAR2(40) NOT NULL,
	 LONGITUDE VARCHAR2(40) NOT NULL,
	 INTRO VARCHAR2(200 CHAR),
	 MENU VARCHAR2(300 CHAR),
	 INFORM VARCHAR2(500 CHAR),
	 LATENCYTIME VARCHAR2(10) NOT NULL);

rem 건대입구
INSERT INTO STOREDB VALUES ('202151745','매화반점','중식','37.538381','127.068479','탕수육과 양꼬치로 유명한 중국요리 전문점입니다. 저녁시간에는 줄을 서서 기다려 먹어야 할 만큼 인기가 많습니다. 이 곳에 메인 요리인 양꼬치는 한 번 구워서 나오기 때문에 연하고 부드러운 최상의 상태로 맛을 볼 수 있습니다. 또한 식감이 매우 좋은 가지 튀김도 인기 메뉴입니다.','깐풍기:12000/깐쇼새우:12000/양갈비:13000/매화식가지볶음:8000/매화식탕수육:10000/양꼬치:9000/꿔바로우:8000/가지볶음:8000','주소 서울특별시 광진구 자양4동 동일로18길 105 / 전화번호 02-498-1939 / OPEN 12:00 CLOSE 01: 00','30');
INSERT INTO STOREDB VALUES ('204684235','페스타마레','이태리양식','37.539480','127.069581','Hand made 이탈리안 피자 '||'&'||' 스파게티 전문 페스타마레 입니다.','빠네까르보나라:10000/빠네씨푸드크림:11000/빠네크랩:11000/빠네포르마지오:11000/빠네맥앤치즈:11000/봉골레비앙코:7500/알리오올리오:8000','주소 서울특별시 광진구 자양4동 2-14 / 전화번호 02-497-9982 / OPEN 11:30 CLOSE20:00','25');
INSERT INTO STOREDB VALUES('254612486','초밥짓는원숭이','일식','37.543102','127.070605','2003년부터 건대 먹자골목에 자리를 잡고 운영되고 있는 초밥 전문점입니다. 초밥짓는 원숭이에서는 수산시장에서 매일 공수해온 신선하고 다양한 계절생선으로 만들어진 초밥을 맛보실 수 있습니다.','사루스시:10000/스시모리아와세:13000/쉐프특선:23000/연어초밥:12000/장어초밥:17000/새우스페셜:15000/오사카세트:20000/훗카이도세트:28000/모듬회:35000/타코와사비:12000','주소 서울시 광진구 능동로 13길 27 / 전화번호 02-467-8238 / OPEN 13:00 CLOSE 22:00','30');
INSERT INTO STOREDB VALUES('215486211','매드포갈릭 건대스타시티점','이태리양식','37.538560','127.073574','시즌별 감성테마에 마늘로 풍미를 더한 창작메뉴, 페어링 와인을 즐길 수 있는곳 매드포 갈릭입니다.','Garlicpeno Pasta:19300/Galic Snowing Pizza:21800/Galic Steak:39300','주소 서울특별시 광진구 자양동 아차산로 262 스타시티몰 지하1층 B143 / 전화번호 02-447-8457 / OPEN 11:30 CLOSE 22:00','34');
INSERT INTO STOREDB VALUES ('259836425','봉자마라탕','중식','37.539622','127.064056','진짜 정통 중국음식 전문점인 곳. 매콤한 마라탕과 볶음요리를 전문으로 하는 봉자마라탕.','마라면:5000/단단면:5000/물에익힌돼지고기:12000/건두부볶음:8000/꼴뚜기매운볶음:10000','주소 서울특별시 광진구 동일로 18길 22 / 전화번호 02-499-8889 / OPEN 11:00 CLOSE 02:00','20');
INSERT INTO STOREDB VALUES ('264521791','서소문순두부보쌈','한식','37.543676','127.065103','맛있는 한정식이 7~8천원! 서소문순두부에서 서소문순두부를 드셔보세요','서소문순두부:7000/옛날할머니순두부:7000/콩비지찌개:7000/청국장:7000/특스페셜보상:60000/삼합:43000','주소 서울특별시 광진구 동일로 128 / 전화번호 02-497-4910 / OPEN 11:00 / CLOSE 22:00','35');
INSERT INTO STOREDB VALUES ('202157945','우마이도','일식','37.543300','127.071799','하카타식 돈코츠라멘의 진수를 보여드립니다.','돈코츠라멘 오리지날:9000/돈코츠라멘 매운맛:10000/교자:4000/아사히맥주:5000','주소 서울특별시 광진구 화양동 능동로 135-2 / 전화번호 024678788 / OPEN 11:30 CLOSE 21:30 / breaktime 14:30~15:00','25');
INSERT INTO STOREDB VALUES ('246879513','미야비','일식','37.543091','127.070612','다양한 일식 도시락, 벤또를 즐겨보세요','야끼우동벤또:6000/차슈벤또:7000/카모로스벤또:8000/오야꼬벤또:9000/사케오야꼬벤또:10000','주소 서울특별시 광진구 화양동 11-21 / 전화번호 02-498-6975 / OPEN 11:00 CLOSE 21:30 / breaktime 15:00~17:00 / last order 21:00','25');
INSERT INTO STOREDB VALUES ('246899512','무스쿠스 건대점','뷔페','37.540567','127.071343','국내 최초의 웰빙형 스시 샐러드 뷔페 패밀리 레스토랑','성인평일점심:23000/성인평일저녁:32000/성인주말공휴일:33000/초등학생평일점심:14000/초등학생평일저녁:16000/초등학생주말공휴일:16000/미취학아동:8000','주소 서울특별시 광진구 능동로 110 스타시티 영존A동 4층 / 전화번호 02-2218-4500 / 영업시간 안내 / 평일런치 11:40 ~ 15:20 / 평일 디너 18:00~21:30 / 주말 공휴일 런치 11:00~13:20 13:40~16:00 / 주말 공휴일 디너 16:30~19:00 19:30~22:00 / breaktime 평일 15:20~18:00','40');
INSERT INTO STOREDB VALUES ('289461321','일마지오(건대점)','이태리양식','37.539513','127.069129','1인 1파스타를 시키면 씬피자가 무한 리필된다! 이태리 음식 전문','파스타:13000/런치세트:8000','주소 서울특별시 광진구 자양동 5-13 / 전화번호 02-3409-8185 / OPEN 11:30 CLOSE 22:30','30');
INSERT INTO STOREDB VALUES ('264875312','로니로티 건대점','이태리양식','37.540874','127.068464','목살스테이크와 파스타류를 판매하는 이탈리아 퓨전레스토랑입니다.','목살스테이크:11900/까르보나라(베이컨 해물):9900/토마토해물스파게티:9900/새우필라프:10900/해물크림,토마토리조또:9900/한우등심스테이크(찹):19900','주소 서울특별시 광진구 화양동 7-44 다산화빌딩 / 전화번호 02-498-7999 / OPEN 11:30 CLOSE 22:30','30');
INSERT INTO STOREDB VALUES ('216484531','메이빌','이태리양식','37.541306','127.068103','빠네파스타와 피자전문점 입니다.','빠네:12800/투움바:11800/고르곤졸라피자:13800/패퍼로니피자:13800/치즈리조또그라탕:10800/감베로니그라당:11000/얼큰국물파스타(크림,토마토):12800','주소 서울특별시 광진구 화양동 48-25 B1F / 전화번호 02-469-4267 / OPEN 11:30 CLOSE 22:00 / 런치타임 11:30~14:00 / lastorder 21:10','30');
INSERT INTO STOREDB VALUES ('234879246','TGIF 건대스타시티점','패밀리레스토랑','37.540818','127.071467','TGI FRIDAY 건대스타시티점 입니다.','크리미머쉬룸치킨파스타:16500/씨푸드토마토파스타:17500/아몬드크러스티드치킨샐러드:15500','주소 서울특별시 광진구 능동로 110 영존빌딩 3층 / 전화번호 02-2218-4535 / OPEN 11:30 CLOSE 10:30','30');

rem 홍대입구
INSERT INTO STOREDB VALUES ('352134810','에머이','베트남음식','37.556008','126.923413','국내 최초 특허 받은 생면 쌀국수를 개발하여 제2의 베트남 음식 전성기를 만들어낸 저력을 바탕으로 음식을 만들어내고 있습니다.','쌀국수:9000/불고기쌀국수:11000/차돌쌀국수:12000/생고기쌀국수:12000/분짜:13000','주소 서울특별시 마포구 156 LG팰리스 빌딩 103호 / 전화번호 02-336-7174 / OPEN 11:00 CLOSE 23:00','20');
INSERT INTO STOREDB VALUES ('352641202','Hakatanaka','일식','37.554994','126.923688','일본 가정식을 맛볼 수 있는 하카타나카입니다.','하카타나카정식:13000','주소 서울시 마포구 서교동 와우산로 23길 52 / 전화번호 02-332-3207 / OPEN 11:30 CLOSE 22:00 / breaktime 15:30~17:00','30');
INSERT INTO STOREDB VALUES ('315648123','라룬비올렛','프렌치 와인바','37.557093','126.920483','낮에는 카페, 저녁엔 와인 비스트로로 운영되는 라룬비올렛 입니다.','에스카르고:13000/관자브릿지:14000/수비드꼬숑:16000','주소 서울시 마포구 동교동 203-18 / 전화번호 023339463 / OPEN 12:00 CLOSE 02:00 / breaktime 15:30~17:30','40');
INSERT INTO STOREDB VALUES ('312321026','질할브로스','이슬람 할랄푸드','37.558931','126.924407','뉴욕 멘하탄을 장악한 뉴욕스타일 길거리 음식!','치킨오버라이스:7800/램오버라이스:8300/콤보라이스:8300/치킨랩샌드위치:5400/램랩샌드위치:5800/치킨라이스랩:6800/램라이스랩:7200','주소 서울시 마포구 서교동 양화로 19길 22-25 / 전화번호 02-324-1422 / OPEN 11:00 CLOSE 22:00','5');
INSERT INTO STOREDB VALUES ('345842131','알라또레','이태리양식','37.553466','126.924671','이탈리안 레스토랑 알라또레입니다.','LambShank:43000/티본스테이크1kg:170000/클래식생면파스타:19000/수제살라미피자:23000/수비드문어샐러드:25000','주소 서울특별시 마포구 서교동 343-11 더모임 빌딩 5층 / 전화번호 02-324-0978 / OPEN 11:30 CLOSE 20:00 / breaktime 15:00~17:00','40');
INSERT INTO STOREDB VALUES ('368984541','이뜰','스테이크','37.553270','126.924029','무한 리필 스테이크 하우스 이뜰입니다.','무한리필스테이크(1인):29700/무한리필와규스테이크:49700/샐러드뷔페(저녁,공휴일):13900/샐러드뷔페(런치):9900/단품블랙엥거스스테이크:11900/찹소고기스테이크:11000/블랙앵거스스테이크(150g)+샐러드뷔페:20500','주소 서울틀별시 마포구 서교동 344-15 2F / 전화번호 02-3141-4459 / OPEN 11:30 CLOSE 20:30','40');
INSERT INTO STOREDB VALUES ('386546313','청해루','중식','37.553320','126.923400','홍대를 오래 지켜온 중국집 청해루입니다.','짜장면:3000/짬뽕:3500/볶음밥:4000/짬뽕밥:4000/쟁반짬뽕:7000/쟁반짜장:4500/잡채밥:7000/물만두:3000/군만두:3000/탕수육(소):8000/깐풍기(소):9000/깐풍육(소):9000','주소 서울시 마포구 서교동 358-14 / 전화번호 02-334-5222 / OPEN 11:00 CLOSE 21:00','25');
INSERT INTO STOREDB VALUES ('375648653','Temple Food','사찰음식','37.552890','126.923516','','','주소 서울시 마포구 서교동 홍익로 3-12','00');
INSERT INTO STOREDB VALUES ('365486313','다락투','닭곰탕','37.552689','126.923554','닭곰탕 닭칼국수 전문점 다락투입니다.','닭곰탕(보통):7000/닭곰탕(특):7500/닭칼국수:7500/공기밥:1000','주소 서울시 마포구 서교동 358-83 / 전화번호 02-336-2918 / OPEN 09:00 CLOSE 21:00','20');
INSERT INTO STOREDB VALUES ('345621356','홍대라면','라면','37.552430','126.923145','화끈한 라면은 여기서 먹어야 제맛!','','주소 서울시 마포구 와우산로21길 14 / 전화번호 02-323-7799 / OPEN 10:00 CLOSE 00:30','10');
INSERT INTO STOREDB VALUES ('323465486','예티','인도요리','37.550577','126.923574','인도커리 전문점 예티입니다.','탈리세트(밥,치킨커리,감자):7000/예티스페셜탈리세트:13000/치킨커리:9000/난:2000/야크치즈:8000/탄두리치킨:15000/2인런치세트(~3pm):28000/2인디너세트(항시):39000','주소 서울시 마포구 서교동 360-22 / 전화번호 02-325-0745 / OPEN 11:00 CLOSE 02:00','30');
INSERT INTO STOREDB VALUES ('333545687','홍대 돈부리 본점','일식','37.552015','126.921355','돈부리는 그 한 그릇으로 배가 불러야한다는 철학으로 운영하고 있습니다.','가츠동:7000/가라아게동:7500/규동:8000/텐동:9500/사케동:9500/우나기동:15000/네기가츠동:8000/에비동:7500/히레가츠동:7500','주소 서울 마포구 서교동 366-18 지하1층 / 전화번호 02-3141-8398 / OPEN 11:00 CLOSE 21:00 / breaktime 15:00~16:30(금,토,일, 공휴일은 제외) / 주차불가','20');

rem 줄서기 관리DB
CREATE TABLE QUEUEDB
	(BARCODE VARCHAR(20) CONSTRAINT PK_QUEUEDB PRIMARY KEY,
	ONOFFLINE NUMBER(1) NOT NULL,
	CONSTRAINT CK_QUEUEDB1 CHECK (ONOFFLINE IN (0,1)),
	STORENUM VARCHAR(10) NOT NULL,
	CONSTRAINT FK_QUEUEDB FOREIGN KEY(STORENUM) REFERENCES STOREDB(STORENUM),
	CREATETIME TIMESTAMP(3) NOT NULL,
	UPDATETIME TIMESTAMP(3),
	STATUS VARCHAR(10 CHAR) NOT NULL,
	CONSTRAINT  CK_QUEUEDB2 CHECK(STATUS IN ('줄서는중','완료','취소','미루기','연락대기'))
	);

rem 업체 계정DB
CREATE TABLE ACCOUNTDB
	(STORENUM VARCHAR2(10) NOT NULL,
	CONSTRAINT FK_ACCOUNTDB FOREIGN KEY(STORENUM) REFERENCES STOREDB(STORENUM),
	STOREID VARCHAR2(20 CHAR) CONSTRAINT PK_ACCOUNTDB PRIMARY KEY,
	STOREPWD VARCHAR2(20 CHAR) NOT NULL
	);

rem 건대입구
INSERT INTO ACCOUNTDB VALUES ('202151745','k1','k1');
INSERT INTO ACCOUNTDB VALUES ('204684235','k2','k2');
INSERT INTO ACCOUNTDB VALUES('254612486','k3','k3');
INSERT INTO ACCOUNTDB VALUES('215486211','k4','k4');
INSERT INTO ACCOUNTDB VALUES ('259836425','k5','k5');
INSERT INTO ACCOUNTDB VALUES ('264521791','k6','k6');
INSERT INTO ACCOUNTDB VALUES ('202157945','k7','k7');
INSERT INTO ACCOUNTDB VALUES ('246879513','k8','k8');
INSERT INTO ACCOUNTDB VALUES ('246899512','k9','k9');
INSERT INTO ACCOUNTDB VALUES ('289461321','k10','k10');
INSERT INTO ACCOUNTDB VALUES ('264875312','k11','k11');
INSERT INTO ACCOUNTDB VALUES ('216484531','k12','k12');
INSERT INTO ACCOUNTDB VALUES ('234879246','k13','k13');

rem 홍대입구
INSERT INTO ACCOUNTDB VALUES ('352134810','h1','h1');
INSERT INTO ACCOUNTDB VALUES ('352641202','h2','h2');
INSERT INTO ACCOUNTDB VALUES ('315648123','h3','h3');
INSERT INTO ACCOUNTDB VALUES ('312321026','h4','h4');
INSERT INTO ACCOUNTDB VALUES ('345842131','h5','h5');
INSERT INTO ACCOUNTDB VALUES ('368984541','h6','h6');
INSERT INTO ACCOUNTDB VALUES ('386546313','h7','h7');
INSERT INTO ACCOUNTDB VALUES ('375648653','h8','h8');
INSERT INTO ACCOUNTDB VALUES ('365486313','h9','h9');
INSERT INTO ACCOUNTDB VALUES ('345621356','h10','h10');
INSERT INTO ACCOUNTDB VALUES ('323465486','h11','h11');
INSERT INTO ACCOUNTDB VALUES ('333545687','h12','h12');

	
rem 정보제공용 VIEW
create view storeview as
select s.storenum, s.storename, s.category, s.latitude, s.longitude, s.intro, s.menu, s.inform, s.latencytime, NVL(q.waitingcount,0) as waitingcount
from storedb s left outer join
(select storenum, count(*) as waitingcount from queuedb where status = '줄서는중' or status ='미루기' group by storenum) q
on s.storenum = q.storenum;

commit;